<template>
  <v-app>
    <v-layout fill-height align-center justify-center>
      <v-card width="600px">
        <v-card-title>광동클래리트로마이신정250mg</v-card-title>
        <v-card-subtitle>성분명: 클래리트로마이신</v-card-subtitle>
        <v-card-text>
          <v-img
            class="mb-3"
            src="https://dbscthumb-phinf.pstatic.net/3323_000_9/20171126022112845_RQZOH3G3T.jpg/A11A4290B001503.jpg?type=m250&wm=N"
          ></v-img>
          <v-tabs show-arrows v-model="tabNumber" color="main" fixed-tabs>
            <v-tab>효능 · 효과</v-tab>
            <v-tab>용법 · 용량</v-tab>
            <v-tab>사용상의 주의사항</v-tab>
          </v-tabs>
          <v-divider></v-divider>
          <div
            class="mt-5 scroll"
            v-html="datas[tabNumber].replace(/\n/g, '<br/>')"
          ></div>
        </v-card-text>
      </v-card>
    </v-layout>
  </v-app>
</template>

<script>
export default {
  data() {
    return {
      tabNumber: 0,
      datas: [
        `○ 유효균종

   황색포도구균, 폐렴연쇄구균, 스트렙토콕쿠스 피오게네스(그룹 A-베타용혈성), 리스테리아 모노사이토제니스, 스트렙토콕쿠스 아갈락티에(그룹 B), 스트렙토콕쿠스 비리단스, 인플루엔자균, 파라인플루엔자균, 모락셀라 카타랄리스, 레기오넬라 뉴모필라, 보르데텔라 백일해, 공장캄필로박터, 헬리코박터 파이로리, 임균, 동물 파스퇴렐라증 병원균, 폐렴 미코플라스마, 클라미디아 트라코마티스, 클로스트리듐 퍼프린젠스, 펩토코커스 나이거, 프로피오니박테륨 아크네, 박테로이데스 멜라니노제니쿠스, 미코박테륨 아비움, 미코박테륨 인트라셀룰라

 ○ 적응증
  - 하기도감염증 : 기관지염, 폐렴 등
  - 상기도감염증 : 인두염, 부비동염 등
  - 피부 및 피부조직 감염증
  - 미코박테륨 아비움, 미코박테륨 인트라셀룰라에 기인한 미코박테리아 감염증
  - 십이지장궤양 환자의 헬리코박터 파일로리 박멸`,
        `○ 성인 : 클래리트로마이신으로서 보통 1회 250mg(역가) 1일 2회 투여하며, 중증 감염증의 경우에는 1회 500mg(역가) 1일 2회 투여한다. 투여기간은 보통 7～14일이다. 크레아티닌청소율이 30mL/min이하인 신부전 환자의 경우에는 용량을 절반으로 줄여야 한다. 즉 1일 1회 250mg(역가), 중증 감염증의 경우에는 1회 250mg(역가) 1일 2회 투여한다. 이런 환자에게는 14일 이상 투여하지 않는다.

 
○ 미코박테리아 감염증 : 이 약으로서 1회 500mg(역가), 1일 2회 투여한다. 이 경우 에탐부톨, 클로
파지민, 리팜핀과 같은 다른 항미코박테리아제와 병용투여 하여야 한다.
 
○ 십이지장궤양 환자의 헬리코박터 파일로리 박멸 : 14일간 이 약으로서 500mg(역가) 1일 3회와
오메프라졸 40mg 1일 1회 병용투여하고, 연속하여 14일간 오메프라졸 40mg 1일 1회 투여한다. 즉, 
클래리트로마이신은 1회 500mg(역가) 1일 3회 14일간(1～14일)투여하고, 오메프라졸을 1일 1회 
40mg을 28일간(1～28일)투여한다.

○ 12세 이상의 소아는 성인과 동일, 12세 미만 소아는 클래리트로마이신 건조시럽을 사용한다.`,
        `1. 다음 환자에는 투여하지 말 것

1) 이 약의 첨가제에 과민반응이 있는 환자
2) 클래리트로마이신, 에리스로마이신 또는 마크로라이드계 항생물질에 과민반응의 병력이 있는 환자
3) 테르페나딘, 시사프리드, 피모짓, 아스테미졸, 돔페리돈을 투여 받고 있는 환자[클래리트로마이신 및(또는) 에리스로마이신과 병용투여 시 QT 연장 및 심부정맥(심실성 빈맥, 심실세동, Torsades de pointes 포함)이 나타나고 이는 클래리트로마이신 및 에리스로마이신에 의해 이들 약물의 간대사가 방해를 받기 때문인 것으로 외국의 시판 후 조사결과 보고되었다. 치명적인 사례도 보고되었다.](‘5.상호작용’참조)
4) QT 연장 또는 심실성 심부정맥(Torsades de pointes 포함)의 병력이 있는 환자
5) 중증 간장애 환자
6) 크레아티닌청소율이 30mL/min 이하인 신장애 환자(서방정에 한함.)
7) 맥각알칼로이드 및 그 유도체(에르고타민, 디히드로에르고타민 등)를 투여 받고 있는 환자[맥각 독성이 나타날 수 있다.]
8) 임부 및 수유부
9) 중추신경계 감염환자
10) 미졸라스틴, 베프리딜을 투여 받고 있는 환자
11) 로바스타틴 또는 심바스타틴을 투여 받고 있는 환자(‘5.상호작용’참조)
12) 티카그렐로(ticagrelor)를 투여받고 있는 환자
13) 콜키신(colchicine)을 투여받고 있는 환자
14) 저칼륨혈증 환자
15) 이 약은 유당을 함유하고 있으므로, 갈락토오스 불내성(galactose intolerance), Lapp 유당분해효소 결핍증(Lapp lactase deficiency) 또는 포도당-갈락토오스 흡수장애(glucose-galactose malabsorption) 등의 유전적인 문제가 있는 환자에게는 투여하면 안 된다. (유당함유 제제에 한함)
2. 다음 환자에는 신중히 투여할 것
1) 간장애 환자(주로 간을 통해 배설된다.)
2) 중등도에서 중증의 신부전 환자(혈중농도가 상승할 수 있음.)
3) 심질환 환자[QT 연장, 심실성 부정맥(Torsades de pointes 포함)을 일으킬 수 있음.]
4) 고령자
5) 다른 항생물질(마크로라이드계, 린코마이신, 클린다마이신, 클로람페니콜 등)를 투여 받고 있는 환자(교차내성에 주의한다.)
6) 브로모크립틴, 카베골린, 페르골리드, 에바스틴, 타크로리무스, 톨터로딘, 할로판트린을 투여 받고 있는 환자
7) 약물에 대한 알레르기가 있는 환자에 투여 시(특히 이 약의 성분과 유사한 구조를 가진 약물 투여 시)에는 신중하게 투여한다.
3. 이상반응
1) 쇽, 아나필락시양 증상 : 드물게 쇽, 아나필락시양 증상(호흡곤란, 경련, 발적 등)을 일으킬 수 있으므로 관찰을 충분히 하고 이상반응이 나타나는 경우에는 투여를 중지하고 적절한 처치를 한다.
2) 과민반응 : 때때로 발진, 드물게 가려움, 두드러기, 경증의 피부발적, 맥관부종, 관절부종, 약물발진 등이 나타날 수 있다.
3) 소화기계 : 때때로 복부팽만감, 구역, 구토, 소화불량, 복통/불쾌감, 가스참, 설사, 구강내 미란, 상복부통증(드물게 경련형태), 구갈, 일과성 치아변색, 드물게 췌장염, 아밀라제 증가, 미각이상, 식욕부진, 변비, 설변색 등의 위장관 장애가 나타났다는 보고가 있다. 위막성대장염, 출혈성 대장염 등 혈변을 동반한 대장염이 나타날 수 있으므로 복통, 빈번한 설사가 나타나는 경우에는 투여를 중지하고 적절한 처치를 한다.
회장창냄술 또는 결장창냄술 등의 해부학적 또는 기능적 위장관질환으로 위장관통과시간이 단축된 환자의 경우 드물게 변에서 이 약이 발견되었다는 보고가 있다(서방정에 한함).
4) 호흡기계 : 발열, 기침, 호흡곤란, 흉부 X선 이상, 호산구 증가 등을 수반하는 호산구성 폐침윤ㆍ간질성폐렴 등이 생길 수 있으므로 이와 같은 증상이 발생하면 투여를 중지하고 코르티코이드의 투여 등 적절한 처치를 실시한다. 만성 기관지염 및 급성 상악동염의 급성악화도 관찰되었다.
5) 혈액계 : 때때로 호산구 증가, 혈소판 감소, 범혈구 감소, 용혈성 빈혈, 백혈구 감소, 무과립구증 등이 나타나기도 하므로 정기적으로 검사하여 충분히 관찰을 하고, 이상반응이 나타나면 투여를 중지하는 등, 적절한 처치를 한다.
6) 중추신경계 : 어지러움, 우울, 미각소실, 후각상실, 불안, 드물게 불면, 악몽, 이명, 착란, 지남력장애, 환각, 정신병, 이인증, 경련(강직간대성, 간대성근경련증, 의식소실발작 등), 떨림, 마비감 등 일과성 중추신경계 이상반응이 나타났다는 보고가 있으나 이 약과의 관련여부는 밝혀지지 않았다. 행동변화, 조증행동이 나타났으나 약물투여를 중단하면 소실된다. 여러 가지 이상반응이 나타날 수 있으므로 관찰을 충분히 하고 이상반응이 나타나는 경우에는 투여를 중지하고 적절한 처치를 한다.
7) 피부 : 스티븐슨-존슨증후군, 독성표피괴사용해 등이 발견되기도 하므로 잘 관찰하고 이상반응이 나타나는 경우에는 투여를 중지하고 부신피질호르몬제의 투여 등 적절한 처치를 실시한다. 알레르기성 자반병이 나타날 수 있으므로 관찰을 충분히 하고 이상반응이 나타나는 경우에는 투여를 중지하고 적절한 처치를 한다. 시판 후 경험 중 ‘호산구증가와 전신성 증상을 동반한 약물 발진(DRESS ; drug rash with eosinophilla and systemic symptoms)'이 나타났다
8) 간장 : 다른 마크로라이드계 항생물질과 마찬가지로 드물게 황달을 동반하거나 또는 동반하지 않는 간세포성 또는 담즙울체성 간염, 간효소치의 증가를 포함한 간기능 장애가 나타났다는 보고가 있다. 이러한 간기능장애는 중증일 수 있으며, 대체로 가역적이다. 몇몇 경우, 사망(fatal outcome)을 동반한 간부전이 보고된 바 있으며, 이는 대체로 중증의 기저질환 및/또는 병용투여된 약제와 관련이 있었다. 전격성간염, AST, ALT, γ-GTP, LDH, ALP 상승, 총 빌리루빈 증가 등을 동반한 간기능장애, 황달, 간부전이 나타날 수 있으므로 관찰을 충분히 하고, 식욕부진, 황달, 진한색의 뇨, 가려움증, 또는 복부압통 등과 같은 간염의 증상과 징후가 나타날 경우 투여를 중지하고 적절한 처치를 한다.
9) 신장 : 드물게 혈청크레아티닌 상승이 일어났다는 보고가 있으나, 이 약과의 관련 여부는 밝혀지지 않았다. 드물게 복용량이 많을 때 BUN이 상승한다는 보고가 있다. 간질성 신염, 신부전, 췌장염 등이 보고되었다. 근육통, 무력감, CPK 상승, 혈중 및 요중 미오글로빈 상승을 특징으로 하는 횡문근융해증이 나타날 수 있으므로 관찰을 충분히 실시하고 이상반응이 나타나는 경우에는 투여를 중지하고 적절한 처치를 하는 등 횡문근융해증에 의한 급성 신부전이 나타날 수 있으므로 주의한다. 핍뇨 등의 증상이나 혈청크레아티닌치 상승 등 신기능 저하가 나타나는 경우에는 투여를 중지하고 적절한 처치를 한다.
10) 균교대증 : 드물게 설염, 구내염, 구강칸디다증이 나타났다는 보고가 있다.
11) 순환기계 : 다른 마크로라이드계와 같이 QT연장, 심실성빈맥, Torsades de pointes가 드물게 보고되었다.
12) 기타 : 드물게 권태감, 두통, 미각도착, 가역적인 청각상실, 이상감각증, 관절통, 근육통, 후각장애가 나타났다는 보고가 있다. 이명, 청각장애인 경우 일반적으로 투여를 중단하면 감소될 수 있으나 투여 연장기간 동안 1일 1g 이상 투여 시 다시 나타날 수 있다. 경구저혈당약물 또는 인슐린을 투여 받는 환자에게서 드물게 저혈당증이 나타났다는 보고가 있다. 시판 후 경험 중 횡문근융해증이 보고되었다. 일부 횡문근융해증의 보고에서, 클래리트로마이신은 스타틴계, 피브레이트계, 콜키신, 또는 알로푸리놀과 병용투여 되었었다.
13) 콜키신과 병용투여시, 특히 고령자와 일부 신부전환자에게 콜키신 독성이 나타났다는 시판 후 보고가 있었다. 이들 환자 중 일부에서는 사망사례도 보고되었다.
14) 한정된 인원수의 소아 AIDS환자의 마이코박테리아 감염증에 이 약을 투여하였을때 환자의 병발 상태에 기인한 이상반응을 제외한 가장 흔하게 보고된 이상반응은 이명, 난청, 구토, 구역, 복통, 자반성 발진, 췌장염 및 아밀라아제 증가이었다. 특정 검사에서 심각하게 비정상적인 수준 (상한 또한 하한치)의 검사치를 분석하였을때 이 약 <15mg/kg/일을 투여한 1명의 소아 AIDS환자에서 심각하게 비정상적인(상승된) 총빌리루빈치를 나타냈으며 이 약 15 이상 <25mg/kg/일을 투여한 환자에서 각각 1명씩 심각하게 비정상적인 SGPT, BUN 및 심각하게 감소된 혈소판수를 나타냈다. 이 약 최고용량 (≤25mg/kg/일)을 투여한 환자에서 심각하게 비정상적인 수치는 보고되지 않았다(건조시럽제에 한함).
15) 면역기능이 저하된 환자에서 특정 검사에서 심각하게 비정상적인 수준(상한 또한 하한치)의 검사치를 분석하였을 때 1일 약 1000mg을 투여한 환자의 약 2-3%에서 AST 및 ALT가 심각하게 비정상적인 수준으로 상승하고 백혈구와 혈소판수가 비정상적으로 낮았다. 또한 더 적은 수의 환자에서 BUN이 상승하였다 (일반정제에 한함).
16) 클래리트로마이신과 관련이 있을 수 있다고 판단되는 이상반응을 전신조직분류와 다음과 같은 빈도분류에 따라 아래 표로 나타내었다: 매우 흔히(≥ 1/10), 흔히(≥ 1/100~< 1/10), 드물게(≥ 1/1000~1/100), 그리고 not known(시판후조사에서 나타난 이상반응으로 데이터로부터 추정할 수 없음). 각 칸에서 이상반응은 중대함이 평가가능할 경우 중대함이 큰 순서부터 기재하였다.`,
      ],
    };
  },
};
</script>

<style scoped>
.scroll {
  height: 40vh;
  overflow: auto;
}
</style>
